This is my Emacs configuration file. It is loaded by =.emacs=. Org mode will
execute the code blocks.

*NOTE:* Don't edit the =configuration.el= file in this directory.
It is created by Org mode. Only edit this one.

To get help: =C-h C-h=
To get help on a mode: =C-h m=

Some parts of this file were copied from other files and tutorials.

*** Set up capure templates for Inbox and Ticker
#+BEGIN_SRC emacs-lisp
  (setq org-capture-templates
        '(("t" "Todo [inbox]" entry
           (file+headline "~/Dropbox/org/gtd/inbox.org" "In")
           "* TODO %i%?")
          ("T" "Tickler" entry
           (file+headline "~/Dropbox/org/gtd/tickler.org" "Tickler")
              "* %i%? \n %U")))
  (global-set-key (kbd "C-c a") 'org-agenda)
  (global-set-key (kbd "C-c c") 'org-capture)
  (setq org-todo-keywords '((sequence "TODO(t)" "WAITING(w)" "|" "DONE(d)" "CANCELLED(c)")))
#+END_SRC

#+RESULTS:
| sequence | TODO(t) | WAITING(w) |   |   | DONE(d) | CANCELLED(c) |

**** Set up refile targets for GTD files
#+BEGIN_SRC emacs-lisp
  (setq org-refile-use-outline-path nil)
  (setq org-refile-targets '(("~/Dropbox/org/gtd/projects.org" :maxlevel . 1)
                             ("~/Dropbox/org/gtd/tickler.org" :maxlevel . 2)
                             ("~/Dropbox/org/gtd/someday.org" :level . 1)))
#+END_SRC

#+RESULTS:
: ((gtd/projects.org :maxlevel . 1) (gtd/tickler.org :maxlevel . 2) (gtd/someday.org :level . 1))


**** set up mypy for static type checking
#+BEGIN_SRC emacs-lisp
(flycheck-define-checker
    python-mypy ""
    :command ("mypy"
              "--ignore-missing-imports"
              "--python-version" "3.7"
              source-original)
    :error-patterns
    ((error line-start (file-name) ":" line ": error:" (message) line-end))
    :modes python-mode)

(add-to-list 'flycheck-checkers 'python-mypy t)
(flycheck-add-next-checker 'python-flake8 'python-mypy t)
#+END_SRC

#+RESULTS:
| python-mypy |

*** Javascript
#+BEGIN_SRC emacs-lisp
(require 'js2-mode)
(add-to-list 'auto-mode-alist '("\\.js\\'" . js2-mode))

;; Better imenu
(add-hook 'js2-mode-hook #'js2-imenu-extras-mode)

(require 'company)
(require 'company-tern)

(add-to-list 'company-backends 'company-tern)
(add-hook 'js2-mode-hook (lambda ()
                           (tern-mode)
                           (company-mode)))
#+END_SRC

#+RESULTS:
| lambda | nil | (tern-mode) | (company-mode) |

    
